# brewfile
# dark-coffee

# HOMEBREW
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'

#CASKS
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'cleanshot'
cask 'datagrip'
cask 'github'
cask 'gitify'
cask 'google-chrome'
cask 'iterm2'
cask 'little-snitch'
cask 'microsoft-teams'
cask 'plex'
cask 'powershell'
cask 'iina'
cask 'rectangle'
cask 'rescuetime'
cask 'silverlight'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'

# BREW
brew 'ansible'
brew 'awscli'
brew 'bat'
brew 'docker'
brew 'docker-compose'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'go'
brew 'hugo'
brew 'mas'
brew 'nano'
brew 'node'
brew 'python'
brew 'python@3.9'
brew 'svn'
brew 'thefuck'
brew 'tree'
brew 'youtube-dl'
brew 'zsh'
brew 'z'

# MAC APPS
mas '1440', id: 1483764819
mas 'Amphetamine', id:937984704
mas 'Deliveries', id: 290986013
mas 'DuckDuckGo Privacy Essentials', id: 1482920575
mas 'Gemini 2', id: 1090488118
mas 'Ghostery Lite', id: 1436953057
mas 'Habitify', id: 1111447047
mas 'MeetingBar', id: 1532419400
mas 'NordVPN IKE', id: 1116599239
mas 'Save to Raindrop.io', id: 1549370672
mas 'Wipr', id: 1320666476

# FONTS
cask 'font-allison'
cask 'font-open-sans'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-caveat'
cask 'font-fira-code'
cask 'font-francois-one'
cask 'font-ibm-plex'
cask 'font-ibm-plex-mono'
cask 'font-ia-writer-duo'
cask 'font-ia-writer-duospace'
cask 'font-pacifico'
cask 'font-satisfy'
